In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.impute import SimpleImputer
from sklearn.model_selection import train_test_split
import warnings
warnings.filterwarnings('ignore')

In [3]:
dataset = pd.read_csv("Titanic.csv")

In [4]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
dataset.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [6]:
dataset.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
age_column = dataset["Age"]

In [9]:
imputer = SimpleImputer(strategy='mean')
age_column_fitted = imputer.fit(np.array(age_column).reshape(-1,1))

In [10]:
age_column_fitted.statistics_

array([29.69911765])

In [11]:
# Find mean using numpy
mean_age = np.mean(age_column)
mean_age

29.69911764705882

## Transform

In [12]:
# Transform the age column
age_column = age_column_fitted.transform(np.array(age_column).reshape(-1,1))

In [13]:
# Change the array to pandas dataframe
age_dataframe = pd.DataFrame(data=age_column, columns=["Age"])

In [15]:
# Check for null values
age_dataframe.isnull().sum()

Age    0
dtype: int64

## Predictor

In [32]:
from sklearn import datasets
from sklearn.model_selection import train_test_split

In [23]:
import sklearn
print(sklearn.__version__)

1.3.0

In [24]:
boston = pd.read_csv("Boston.csv")

In [25]:
boston.head()

,Unnamed: 0,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv
0,1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

In [26]:
boston.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 15 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  506 non-null    int64
 1   crim        506 non-null    float64
 2   zn          506 non-null    float64
 3   indus       506 non-null    float64
 4   chas        506 non-null    int64
 5   nox         506 non-null    float64
 6   rm          506 non-null    float64
 7   age         506 non-null    float64
 8   dis         506 non-null    float64
 9   rad         506 non-null    int64
 10  tax         506 non-null    int64
 11  ptratio     506 non-null    float64
 12  black       506 non-null    float64
 13  lstat       506 non-null    float64
 14  medv        506 non-null    float64
dtypes: float64(11), int64(4)
memory usage: 59.4 KB

In [28]:
boston.columns

Index(['Unnamed: 0', 'crim', 'zn', 'indus', 'chas', 'nox', 'rm', 'age', 'dis',
       'rad', 'tax', 'ptratio', 'black', 'lstat', 'medv'],
      dtype='object')

In [31]:
features = boston.drop(columns=["medv"])
label = boston["medv"]

In [33]:
X_train, X_test, y_train, y_test = train_test_split(features, label, test_size=0.2, random_state=101)

In [35]:
from sklearn.linear_model import LinearRegression

linear = LinearRegression()

In [37]:
trained_model = linear.fit(X_train, y_train)

In [38]:
trained_model.predict(X_test)

array([40.4385764 , 28.02459591, 16.31312493, 17.32358533, 31.10250836,
       32.75919769, 39.96009623,  8.57481634, 33.32768515,  7.27384968,
       29.96166264, 13.77651806, 16.28981384, 16.53980751, 25.14669157,
       19.89438538,  6.78381846, 32.95286375, 28.52527519, 24.60432789,
       12.80706714, 20.45668449, 22.0408566 , 24.94561689, 33.97918115,
       19.18270655, 31.8003588 , 19.17975436, 26.47341406, 34.15264093,
       19.62761742, 18.39453685, 36.961432  , 44.43932487, 30.65636184,
       22.32043806, 16.15293556, 18.01672744,  4.79604741, 30.53541189,
       23.89912828, 16.34250671, 35.37313876, 13.87819907, 17.81492847,
       25.19469745, 30.87528921, 16.54339231, 26.73553385, 23.20521564,
       32.5989996 , 38.80921453, 22.22293233, 15.74715104, 30.67225794,
       -0.2343843 , 20.18632159, 16.92736669, 22.52784908, 20.76083372,
       30.5616121 ,  3.4379242 , 13.98228435, 19.35142823, 10.01881493,
       24.79412546, 24.18094374, 19.29185643, 18.40303895, 18.87328593,
       23.62171362, 21.31203829, 23.0280426 , 20.35638346, 26.82700384,
       21.06582486, 37.04064699,  7.94728234, 28.49962669, 17.72642838,
       15.52648752, 19.82875175, 30.57847552, 18.08881906, 10.52771735,
       21.44137458, 21.73317374, 33.10237244, 22.77498991, 21.71316176,
       13.07312861, 11.93178103, 23.10095191, 33.99860451,  6.21990676,
       35.86084113,  8.10031348, 32.17560523,  8.3692439 , 20.58673162,
       33.15647516, 21.4170802 ])

In [39]:
from sklearn.metrics import mean_absolute_error

mean_absolute_error(y_test, trained_model.predict(X_test))

3.986139846075684

In [46]:
predictions = linear.predict(X_test)
print(f"Actual values : {[y_test[10:15]]}\n")
print(f"Predicted : {predictions[10:15]}")

Actual values : [65     23.5
138    13.3
18     20.2
352    18.6
114    18.5
Name: medv, dtype: float64]

Predicted : [29.96166264 13.77651806 16.28981384 16.53980751 25.14669157]

In [47]:
print(f"Model score : {linear.score(X_test, y_test)*100}")

Model score : 70.49030948276646